# Analysis of json data

In [1]:
import pandas as pd
import numpy as np

In [2]:
students = {
    "firstName": ['sabita',None, 'bhawana','NA' ,'puja', 'sangita', None, 'NA'],
    "lastName": ['rajbanshi',None, 'singh',np.nan, np.nan, 'magar', 'NA', 'gharti'],
    "email": ['sabita@gmail.com',None, 'bhawana@email.com', None,'puja@email.com', 'sangita@yahoo.co.uk',None, np.nan],
    "age": ['25',None, '20', '50', '45', None,None, 'Missing']
    
}

In [3]:
#create a dataframe
df = pd.DataFrame(students)

In [4]:
#replace 'Na' and 'Missing' values as np.nan
df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)

In [5]:
df

  firstName   lastName                email   age
0    sabita  rajbanshi     sabita@gmail.com    25
1      None       None                 None  None
2   bhawana      singh    bhawana@email.com    20
3       NaN        NaN                 None    50
4      puja        NaN       puja@email.com    45
5   sangita      magar  sangita@yahoo.co.uk  None
6      None        NaN                 None  None
7       NaN     gharti                  NaN   NaN

In [6]:
#drop if any missing values in a row
df.dropna()

  firstName   lastName              email age
0    sabita  rajbanshi   sabita@gmail.com  25
2   bhawana      singh  bhawana@email.com  20

In [7]:
#drop if any missing values in columns
df.dropna(axis='columns', how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7]

In [8]:
#drop if any missing values in rows
df.dropna(axis='index', how='any')

  firstName   lastName              email age
0    sabita  rajbanshi   sabita@gmail.com  25
2   bhawana      singh  bhawana@email.com  20

In [9]:
#drop if all values are missing in a row
df.dropna(axis='index', how='all')

  firstName   lastName                email   age
0    sabita  rajbanshi     sabita@gmail.com    25
2   bhawana      singh    bhawana@email.com    20
3       NaN        NaN                 None    50
4      puja        NaN       puja@email.com    45
5   sangita      magar  sangita@yahoo.co.uk  None
7       NaN     gharti                  NaN   NaN

In [10]:
#drop if both lastname and email values are missing and also if all the values in a row are missing
df.dropna(axis='index', how='all', subset=['lastName','email'])

  firstName   lastName                email   age
0    sabita  rajbanshi     sabita@gmail.com    25
2   bhawana      singh    bhawana@email.com    20
4      puja        NaN       puja@email.com    45
5   sangita      magar  sangita@yahoo.co.uk  None
7       NaN     gharti                  NaN   NaN

In [11]:
#to see the boolean values 
df.isna()

   firstName  lastName  email    age
0      False     False  False  False
1       True      True   True   True
2      False     False  False  False
3       True      True   True  False
4      False      True  False  False
5      False     False  False   True
6       True      True   True   True
7       True     False   True   True

In [12]:
#fill the missing values with 0
df.fillna(0)

  firstName   lastName                email age
0    sabita  rajbanshi     sabita@gmail.com  25
1         0          0                    0   0
2   bhawana      singh    bhawana@email.com  20
3         0          0                    0  50
4      puja          0       puja@email.com  45
5   sangita      magar  sangita@yahoo.co.uk   0
6         0          0                    0   0
7         0     gharti                    0   0

In [13]:
df.dtypes

firstName    object
lastName     object
email        object
age          object
dtype: object

In [14]:
#nan value is type float
type(np.nan)

float

In [15]:
#convert age as float type using astype() method
df['age'] = df['age'].astype(float)

In [16]:
df.dtypes

firstName     object
lastName      object
email         object
age          float64
dtype: object

In [17]:
df['age'].mean()

35.0

# Analysis of stack overflow developer survey

In [18]:
na_vals =['NA', 'Missing']
df = pd.read_csv('data/survey_results_public.csv', index_col='Respondent', na_values=na_vals)
schema_df = pd.read_csv('data/survey_results_schema.csv', index_col='Column', na_values=na_vals)

In [19]:
df.head()

,MainBranch,Hobbyist,Age,Age1stCode,CompFreq,CompTotal,ConvertedComp,Country,CurrencyDesc,CurrencySymbol,...,SurveyEase,SurveyLength,Trans,UndergradMajor,WebframeDesireNextYear,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
Respondent,,,,,,,,,,,,,,,,,,,,,
1,I am a developer by profession,Yes,NaN,13,Monthly,NaN,NaN,Germany,European Euro,EUR,...,Neither easy nor difficult,Appropriate in length,No,"Computer science, computer engineering, or sof...",ASP.NET Core,ASP.NET;ASP.NET Core,Just as welcome now as I felt last year,50.0,36,27
2,I am a developer by profession,No,NaN,19,NaN,NaN,NaN,United Kingdom,Pound sterling,GBP,...,NaN,NaN,NaN,"Computer science, computer engineering, or sof...",NaN,NaN,Somewhat more welcome now than last year,NaN,7,4
3,I code primarily as a hobby,Yes,NaN,15,NaN,NaN,NaN,Russian Federation,NaN,NaN,...,Neither easy nor difficult,Appropriate in length,NaN,NaN,NaN,NaN,Somewhat more welcome now than last year,NaN,4,NaN
4,I am a developer by profession,Yes,25.0,18,NaN,NaN,NaN,Albania,Albanian lek,ALL,...,NaN,NaN,No,"Computer science, computer engineering, or sof...",NaN,NaN,Somewhat less welcome now than last year,40.0,7,4
5,"I used to be a developer by profession, but no...",Yes,31.0,16,NaN,NaN,NaN,United States,NaN,NaN,...,Easy,Too short,No,"Computer science, computer engineering, or sof...",Django;Ruby on Rails,Ruby on Rails,Just as welcome now as I felt last year,NaN,15,8

In [20]:
df['YearsCode'].head()

Respondent
1    36
2     7
3     4
4     7
5    15
Name: YearsCode, dtype: object

In [21]:
#TypeError: can only concatenate str (not "int") to str
#df['YearsCode'].mean()

In [22]:
#ValueError: could not convert string to float: 'Less than 1 year'
#df['YearsCode'] = df['YearsCode'].astype(float)

In [23]:
#unique values in column YearsCode
df['YearsCode'].unique()

array(['36', '7', '4', '15', '6', '17', '8', '10', '35', '5', '37', '19',
       '9', '22', '30', '23', '20', '2', 'Less than 1 year', '3', '13',
       '25', '16', '43', '11', '38', '33', nan, '24', '21', '12', '40',
       '27', '50', '46', '14', '18', '28', '32', '44', '26', '42', '31',
       '34', '29', '1', '39', '41', '45', 'More than 50 years', '47',
       '49', '48'], dtype=object)

In [24]:
#replace 'less than 1 year' as '0' and 'more than 50 years' as 51
df['YearsCode'].replace('Less than 1 year', 0, inplace=True)
df['YearsCode'].replace('More than 50 years', 51, inplace=True)

In [25]:
df['YearsCode'].unique()

array(['36', '7', '4', '15', '6', '17', '8', '10', '35', '5', '37', '19',
       '9', '22', '30', '23', '20', '2', 0, '3', '13', '25', '16', '43',
       '11', '38', '33', nan, '24', '21', '12', '40', '27', '50', '46',
       '14', '18', '28', '32', '44', '26', '42', '31', '34', '29', '1',
       '39', '41', '45', 51, '47', '49', '48'], dtype=object)

In [26]:
df['YearsCode'] = df['YearsCode'].astype(float)

In [27]:
df['YearsCode'].mean()

12.709052770265584

In [28]:
df['YearsCode'].median()

10.0